Autodesk.Revit.DB.PointClouds.PointCloudFilter.Clone
Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.
Returns:
A copy of the original filter.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudFilter.PrepareForCell(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Int32)
Informs the filter that a series of points within a given cell is about to be checked.
Remarks:
This is a performance hook that the filter can use to minimize computational work per TestPoint() call
within a given cell.
The engine should guarantee that all points passed to TestPoint() calls
will fall inside the (min, max) box specified here. This promise must be in effect until
the next PrepareForCell() call.
min:
The lower corner of the cell.
max:
The upper corner of the cell.
numTests:
The engine's estimate of the number of TestPoint() calls it is going to make for this cell.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudFilter.TestCell(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Checks whether a given cell, i.e. a box aligned with the XYZ axes, is inside, outside
or on the border of the volume of interest.
min:
The lower corner of the cell.
max:
The upper corner of the cell.
Returns:
-1 -- The cell is entirely rejected.
0 -- The cell partially belongs to the volume of interest.  Use PrepareForCell() and TestPoint() to
evaluate individual points.
1 -- The cell is fully accepted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudFilter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudFilter.TestPoint(Autodesk.Revit.DB.PointClouds.CloudPoint)
Checks if a point is inside the volume of interest.
point: The point to be tested.
Returns: If true, the point is accepted, if false, the point is not accepted.

Autodesk.Revit.DB.PointClouds.PointCloudFilter
A class used to describe the criteria an application desires when obtaining members of a point cloud.
Remarks:
Client applications which wish to obtain points from a point cloud will have to create a
PointCloudFilter to define the volume of interest (see PointCloudFilterFactory).
Engine implementations will need to use the methods contained within the point cloud to determine
which points to return to Revit.
Since:
2012